******************************************************************************* /
#include <iostream>
using namespace std;

string stroka(int x)
{
	return to_string(x);
}

int main()
{

	int n;
	int c[4];
	string s[3][3];
	s[0][0] = "тысяча";
	s[0][1] = "тысячи";
	s[0][2] = "тысяч";
	s[1][0] = "миллион";
	s[1][1] = "миллиона";
	s[1][2] = "миллионов";
	s[2][0] = "миллиард";
	s[2][1] = "миллиарда";
	s[2][2] = "миллиардов";
	s[3][0] = ' ';
	s[3][1] = ' ';
	s[3][2] = ' ';

	cout << "vvedite chislo do 1 000 000" << endl;
	cin >> n >> endl;
	c[0] = (n % 1000000) / 1000;
	c[1] = (n % 1000000000) / 1000000;
	c[2] = (n % 1000000000) / 1000000000;
	c[3] = n % 1000;

	for (i = 0; i<3; i++)
	{
		int x = c[i];
		cout << n << " = " << stroka(x) << s[i][0] << endl;
	}



}
