******************************************************************************* / #include <iostream>
using namespace std;

string stroka(int x)
{
	return to_string(x);
}

int main()
{

	int n;
	int c[4];
	string s[4][3];
	s[0][0] = ' ';
	s[0][1] = ' ';
	s[0][2] = ' ';
	s[1][0] = "тысяча";
	s[1][1] = "тысячи";
	s[1][2] = "тысяч";
	s[2][0] = "миллион";
	s[2][1] = "миллиона";
	s[2][2] = "миллионов";
	s[3][0] = "миллиард";
	s[3][1] = "миллиарда";
	s[3][2] = "миллиардов";

	cout << "vvedite chislo do 1 000 000" << endl;

	cin >> n;

	c[0] = n % 1000;
	c[1] = (n % 1000000) / 1000;
	c[2] = (n % 1000000000) / 1000000;
	c[3] = (n % 1000000000) / 1000000000;

	//переменная для проверки окончания для разрядов
	e[1] = (n % 1000000) / 1000 % 10; //переменная для разряда единиц в тысячах
	e[2] = (n % 1000000000) / 1000000 % 10; //для разряда единиц в миллионах
	e[3] = (n % 1000000000000) / 1000000000 % 10; //для разряда единиц в миллиардах

	/*далее можно будет создать массивы с десятками("двадцать,тридцать.. шестьдесят" и тд) и сотнями(сто двести триста...)
	d[1]=(n%1000000)/1000%100; #переменная для разряда десятков в тысячах
	d[2]=(n%1000000000)/1000000%100; # для разряда десятков в миллионах
	d[3]=(n%1000000000000)/1000000000%100; # для разряда десятков в миллиардах */

												  //Это для проверки правильно ли посчитала окончания разрядов
	cout << (n % 1000000) / 1000 % 10 << endl;
	cout << (n % 1000000000) / 1000000 % 10 << endl;
	cout << (n % 1000000000000) / 1000000000 % 10 << endl;

	cout << n << " = " << endl;

	for (int i = 3; i>0; i--)
	{
		if (e[i] == 1)
		{
			int x = c[i];
			cout << stroka(x) << ' ' << s[i][0] << ' ';
		}

		else if (1<e[i]<5)
		{
			int x = c[i];
			cout << stroka(x) << ' ' << s[i][1] << ' ';
		}
		else if (4<e[i]<10 || e[i] == 0)
		{
			int x = c[i];
			cout << stroka(x) << ' ' << s[i][2] << ' ';
		}
	}


	//  2 134 234 234 #пример если в консоли ошибки и нельзя глянуть
}

