#include <string>
#include "stdafx.h"
#include <iostream>
using namespace std;

const string Sotn[10] = { "","сто", "двести", "триста", "четыреста", "п€тьсот", "шестьсот", "cемьсот", "восемьсот", "дев€тьсот" };
const string Decn[10] = { "", "", "двадцать", "тридцать", "сорок", "п€тьдес€т", "шестьдес€т", "cемьдес€т", "восемьдес€т", "дев€носто" };
const string Edn[20] = { "", "один", "два", "три", "четыре", "п€ть", "шесть", "cемь", "восемь", "дев€ть", "дес€ть", "одиннадцать", "двенадцать","тринадцать", "четырнадцать", "п€тнадцать", "шестнадцать", "cемнадцать", "восемнадцать", "дев€тнадцать" }

string stroka(int x)
{	
	int ed = x % 10;
	int dec = x / 10 % 10;
	int sot = x / 100;

	string sSot = Sotn[sot];
	string sDec = Decn[dec];
	if (dec == 1)
	{
		ed += 10;
	}
	string sEd = Edn[ed];

	return sSot+" "+sDec + " "+sEd;
}

int main()
{
	setlocale(LC_ALL, "Russian");

	//

	long long int n;
	int c[4];
	string s[4][3] = { {' ', ' ', ' ' }, { "тыс€ча", "тыс€чи", "тыс€ч"}, {"миллион", "миллиона", "миллионов"}, {"миллиард", "миллиарда", "миллиардов"} }
	/*s[0][0] = ' ';						 
	s[0][1] = ' ';						  
	s[0][2] = ' ';
	s[1][0] = "тыс€ча";
	s[1][1] = "тыс€чи";
	s[1][2] = "тыс€ч";
	s[2][0] = "миллион";ы
	s[2][1] = "миллиона";
	s[2][2] = "миллионов";
	s[3][0] = "миллиард";
	s[3][1] = "миллиарда";
	s[3][2] = "миллиардов"; */

	cout << "vvedite chislo do 1 000 000" << endl;

	cin >> n;

	c[0] = n % 1000;
	c[1] = (n % 1000000) / 1000;
	c[2] = (n % 1000000000) / 1000000;
	c[3] = n / 1000000000;

	cout << n << " = " << endl;

	for (int i = 3; i >= 0; i--)
	{	
		int x = c[i];
		if (x==0)
		{	
			continue;
		}
		int e = x % 10;
		int d = x / 10 % 10;
		int okonchanie;

		if (e == 1 && d != 1)
		{
			okonchanie = 0;
		}

		else if (1 < e && e < 5 && d != 1)
		{
			okonchanie = 1;
		}
		else 
		{
			okonchanie = 2;
		}
		cout << stroka(x) << ' ' << s[i][okonchanie] << ' ';
	}
}
/*«аписать число ноль,
ѕоддержать отрицательные числа, чтобы писалось слово "минус" 
ѕоддержать числа до 10^18
—делать цикл дл€ заполнени€ массива с[4]
*поддержать числа до дециллиона (10^33)
https://ru.wikipedia.org/wiki/%D0%98%D0%BC%D0%B5%D0%BD%D0%BD%D1%8B%D0%B5_%D0%BD%D0%B0%D0%B7%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F_%D1%81%D1%82%D0%B5%D0%BF%D0%B5%D0%BD%D0%B5%D0%B9_%D1%82%D1%8B%D1%81%D1%8F%D1%87%D0%B8
тренарные операторы
—делать так, чтобы число можно было задавать параметром командной строки
сделать константные массивы 
прочитать про юнит тесты и сделать функцию дл€ юнит тестов*
*/
