******************************************************************************* / #include <iostream>
using namespace std;

string stroka(int x)
{
	return to_string(x);
}

int main()
{

	int n;
	int c[4];
	string s[4][3];
	s[0][0] = ' ';
	s[0][1] = ' ';
	s[0][2] = ' ';
	s[1][0] = "тысяча";
	s[1][1] = "тысячи";
	s[1][2] = "тысяч";
	s[2][0] = "миллион";
	s[2][1] = "миллиона";
	s[2][2] = "миллионов";
	s[3][0] = "миллиард";
	s[3][1] = "миллиарда";
	s[3][2] = "миллиардов";

	cout << "vvedite chislo do 1 000 000" << endl;

	cin >> n;

	c[0] = n % 1000;
	c[1] = (n % 1000000) / 1000;
	c[2] = (n % 1000000000) / 1000000;
	c[3] = (n % 1000000000) / 1000000000;


	cout << n << " = " << endl;

	for (int i = 3; i>0; i--)
	{
		int x = c[i];
		cout << stroka(x) << ' ' << s[i][0] << ' ';
	}



}
